emacs/exec-path-from-shell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-05 四 21:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>exec-path-from-shell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">exec-path-from-shell</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3c90422">1. 概述</a></li>
<li><a href="#orgc8854c6">2. 原理</a></li>
<li><a href="#org7645540">3. 兼容性</a></li>
<li><a href="#org090018e">4. 安装</a></li>
<li><a href="#org1f1a768">5. 配置</a>
<ul>
<li><a href="#org9e61e4a">5.1. 正确设置 shell 启动文件</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org3c90422" class="outline-2">
<h2 id="org3c90422"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://github.com/purcell/exec-path-from-shell">exec-path-from-shell</a> 是一个 GNU Emacs 库，用于确保 Emacs 中的环境变量与用户 shell 中的环境变量相同。
</p>
</div>
</div>

<div id="outline-container-orgc8854c6" class="outline-2">
<h2 id="orgc8854c6"><span class="section-number-2">2</span> 原理</h2>
<div class="outline-text-2" id="text-2">
<p>
你是否曾经发现在 shell 中正常运行的命令，但在 Emacs 中无法找到？
</p>

<p>
这在 OS X 上经常发生，因为以 GUI 启动的 Emacs 实例继承了一组默认的环境变量。
</p>

<p>
这个库通过从用户的 shell 复制重要的环境变量来解决这个问题：它的工作原理是让你的 shell 打印变量，然后将它们复制到 Emacs 环境中。
</p>
</div>
</div>


<div id="outline-container-org7645540" class="outline-2">
<h2 id="org7645540"><span class="section-number-2">3</span> 兼容性</h2>
<div class="outline-text-2" id="text-3">
<p>
如果在 Emacs 中通过对 <code>(getenv"SHELL")</code> 求值打印的路径指向 bash 或 zsh，这应该可以正常工作。
</p>

<p>
至少，这个包假定你的 shell 至少是 UNIX-y：如果 <code>(getenv"SHELL")</code> 求值为类似 <code>"... / cmdproxy.exe"</code> ，这个包可能不适合你。
</p>

<p>
此外，如果使用非 POSIX 标准 shell（如 tcsh 或 fish），则会要求您的 shell 将 sh 作为子 shell 执行，以便可以用可靠解析的格式打印变量。在这种情况下，sh 必须是符合 POSIX 的 shell。
</p>

<p>
请注意，尚未导出为环境变量的 shell 变量（例如，使用"export"关键字）可能对`exec-path-from-shell'不可见。
</p>
</div>
</div>

<div id="outline-container-org090018e" class="outline-2">
<h2 id="org090018e"><span class="section-number-2">4</span> 安装</h2>
</div>

<div id="outline-container-org1f1a768" class="outline-2">
<h2 id="org1f1a768"><span class="section-number-2">5</span> 配置</h2>
<div class="outline-text-2" id="text-5">
<p>
将以下内容添加到 init.el 中（在调用 package-initialize 之后）：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">when</span> (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
</pre>
</div>

<p>
这将从您的 shell 设置$ MANPATH，$ PATH 和 exec-path，但仅限于 OS X 和 Linux。
</p>

<p>
可以通过在调用 exec-path-from-shell-initialize 之前自定义 exec-path-from-shell-variables，或者通过调用 exec-path-from-shell-copy-env 来复制其他环境变量的值，例如：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(exec-path-from-shell-copy-env <span style="color: #ff4ea3;">"PYTHONPATH"</span>)
</pre>
</div>

<p>
也可以交互地调用该函数。
</p>
</div>

<div id="outline-container-org9e61e4a" class="outline-3">
<h3 id="org9e61e4a"><span class="section-number-3">5.1</span> 正确设置 shell 启动文件</h3>
<div class="outline-text-3" id="text-5-1">
<p>
请注意，当 shell 由 exec-path-from-shell 运行时，shell 将继承 Emacs 的环境变量- 以避免意外，配置文件应将环境变量设置为其确切的所需最终值，即不要执行此操作：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">export</span> <span style="color: #ff8700;">PATH</span>=/usr/local/bin:$<span style="color: #ff8700;">PATH</span>
</pre>
</div>

<p>
而是这样做：
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">export</span> <span style="color: #ff8700;">PATH</span>=/usr/local/bin:/usr/bin:/bin
</pre>
</div>

<p>
您还应该设置环境变量，以便它们可用于交互式 shell 和非交互式 shell。实际上，对于大多数人来说，这意味着将它们设置在 <code>~/.profile，~/.bash_profile，~/.zshenv</code> 而不是 <code>~/.bashrc</code> 和 <code>~/.zshrc</code> 中。默认情况下，exec-path-from-shell 会以一些执行时间为代价检查此错误。如果您的配置文件设置正确，您可以在调用 exec-path-from-shell-initialize 之前适当地设置 exec-path-from-shell-arguments（通常为 nil）以避免此开销。进一步帮助
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2019-09-05 四 21:27</p>
<p class="validation"></p>
</div>
</body>
</html>
